InformationRegisters/НастройкиУчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаЗарплаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьФорматОбменаЗУП25</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписаниеДепонированныхСумм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервОтпусков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродолжительностьОтпуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаАванса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаАванса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндивидуальныйАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерЕжегоднойПремии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРасчетПервойПоловиныМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДатаВыплатыАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДатаВыплатыЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfCalculationTypes/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCalculationTypes>
		<Properties>
			<Name>Начисления</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КатегорияНачисленияИлиНеоплаченногоВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииНачисленийИНеоплаченногоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияДляНУ</Name>
					<Comment>Вид начисления для налогового учета по налогу на прибыль</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачисленийОплатыТрудаДляНУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаНДФЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаСтраховыеВзносы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовПоСтраховымВзносам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяДоходомВНатуральнойФорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМесяцевБазовогоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВБазуРКИСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтношениеКЕНВД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКЕНВДЗатратНаЗарплату</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииПоЗарплате</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачетОтработанногоВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаСтраховыеВзносы2017</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовПоСтраховымВзносам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияДохода</Name>
					<Comment>АПК:58 имя ВидДохода уже занято</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпределенияМесяцаДоходаВВидеОплатыТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОпределенияМесяцаДоходаВВидеОплатыТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоходаИсполнительногоПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовИсполнительногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаРаздела2Расчета6НДФЛ</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтрокиРаздела2Расчета6НДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоходаИсполнительногоПроизводства2022</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовИсполнительногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднийЗаработокОбщий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УчетНачисленийВСреднемЗаработкеОбщий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCalculationTypes>
</MetaDataObject>

CommonModules/РезервыПоОплатеТрудаДляНебольшихОрганизацийПереопределяемый/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Учет резервов для небольших организаций.
// Переопределяемое в потребителе поведение.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура предназначена для заполнения в полученной таблице информации об особенностях расчета отпусков
// с учетом специфики места внедрения.
//
// Параметры:
//   НачисленнаяЗарплатаИВзносы - таблица значений
//		Структура таблицы НачисленнаяЗарплатаИВзносы (необходимые колонки)
//			Начисление
//			КомпенсацияОтпуска
//
Процедура ДополнитьТаблицуСведениямиОбОсобенностяхОтпусков(НачисленнаяЗарплатаИВзносы) Экспорт
	
	Отбор = Новый Структура("КатегорияНачисленияИлиНеоплаченногоВремени", Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска);
	ВидНачисленияОтпуск = ПланыВидовРасчета.Начисления.НачислениеПоУмолчанию(Отбор);
	
	Отбор = Новый Структура("КатегорияНачисленияИлиНеоплаченногоВремени", Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска);
	ВидНачисленияКомпенсацияОтпуска = ПланыВидовРасчета.Начисления.НачислениеПоУмолчанию(Отбор);
	
	ЗначенияКолонкиНачисление = ОбщегоНазначения.ВыгрузитьКолонку(НачисленнаяЗарплатаИВзносы, "Начисление", Истина);
	МассивНачислений = Новый Массив;
	Для Каждого ЗаписьМассива Из ЗначенияКолонкиНачисление Цикл
		Если ЗначениеЗаполнено(ЗаписьМассива)
			И ТипЗнч(ЗаписьМассива) = Тип("ПланВидовРасчетаСсылка.Начисления") Тогда
			МассивНачислений.Добавить(ЗаписьМассива);
		КонецЕсли;
	КонецЦикла;
	ДанныеНачислений = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНачислений, "ОсновнойВидРасчета");
	
	Для Каждого СтрокаТаблицы Из НачисленнаяЗарплатаИВзносы Цикл
		
		ОсновноеНачисление = СтрокаТаблицы.Начисление;
		ОсновнойВидРасчетаОплатыПоСреднему = ДанныеНачислений[ОсновноеНачисление];
		Если ОсновноеНачисление = ВидНачисленияОтпуск Или ОсновнойВидРасчетаОплатыПоСреднему = ВидНачисленияОтпуск
			Или ОсновноеНачисление = ВидНачисленияКомпенсацияОтпуска Или ОсновнойВидРасчетаОплатыПоСреднему = ВидНачисленияКомпенсацияОтпуска Тогда
			СтрокаТаблицы.ВидОтпуска = "Основной";
		КонецЕсли;
		СтрокаТаблицы.КомпенсацияОтпуска =
			ОсновноеНачисление = ВидНачисленияКомпенсацияОтпуска Или ОсновнойВидРасчетаОплатыПоСреднему = ВидНачисленияКомпенсацияОтпуска;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура предназначена для проверки наличия обмена с программой учета зарплаты
//
// Параметры:
//   ОбменИспользуется - Булево, переопределяется в зависимости от настройки
//
Процедура ОбменИспользуется(ОбменИспользуется) Экспорт
	
	Если ОбменИспользуется Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровСредствамиБухгалтерии") Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ОбменИспользуется Тогда
		
		МДПланОбмена = Метаданные.ПланыОбмена.Найти("СинхронизацияДанныхЧерезУниверсальныйФормат");
		Если МДПланОбмена <> Неопределено Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ЭтотУзел",               ПланыОбмена["СинхронизацияДанныхЧерезУниверсальныйФормат"].ЭтотУзел());
			Запрос.УстановитьПараметр("ИдентификаторНастройки", "ОбменЗУПБП");
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ОбменЗарплата3Бухгалтерия3.Ссылка
			|ИЗ
			|	#ПолноеИмяПланаОбмена КАК ОбменЗарплата3Бухгалтерия3
			|ГДЕ
			|	ОбменЗарплата3Бухгалтерия3.Ссылка <> &ЭтотУзел
			|	И ОбменЗарплата3Бухгалтерия3.ВариантНастройки = &ИдентификаторНастройки";
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ПолноеИмяПланаОбмена", МДПланОбмена.ПолноеИмя());
			ОбменИспользуется = Не Запрос.Выполнить().Пустой();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура предназначена для дополнения таблицы параметров данными о проценте годовой премии
// и с учетом специфики места внедрения.
//
// Параметры:
//   Организация       - Спр.Организации.СправочникСсылка - Организация.
//   Период            - Дата - Период дат.
//   ДанныеПоказателей - таблица значений.
//		Структура таблицы ДанныеПоказателей.
//			Сотрудник
//			ФондОплатыТруда
//			ПроцентГодовойПремии
//
Процедура ДополнитьТаблицуПроцентомГодовойПремии(Организация, Период, ДанныеПоказателей) Экспорт
	
	ДанныеПоказателей.Свернуть("Сотрудник, ПроцентГодовойПремии", "Сумма");
	
	НастройкиУчетаЗарплаты = РегистрыСведений.НастройкиУчетаЗарплаты.Получить(Новый Структура("Организация", Организация));
	РазмерЕжегоднойПремии  = НастройкиУчетаЗарплаты.РазмерЕжегоднойПремии;
	
	ДанныеПоказателей.ЗаполнитьЗначения(РазмерЕжегоднойПремии, "ПроцентГодовойПремии");
	
КонецПроцедуры

// Процедура предназначена для формирования списка оплачиваемых за счет резерва отпусков
// с учетом специфики места внедрения.
//
// Параметры:
//   МассивВидовОтпусковРезерва - Массив.
//
Процедура ПолучитьМассивВидовОтпусковРезерва(МассивВидовОтпусковРезерва) Экспорт
	
	МассивВидовОтпусковРезерва.Добавить("Основной");
	
КонецПроцедуры

#КонецОбласти
